{"config": {"layers": [{"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 512, "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "batch_input_shape": [null, 3000], "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 256, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "sigmoid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 2, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_3"}}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}